from typing import Any, Dict, List
import json

from langchain_core.prompts import PromptTemplate, ChatPromptTemplate
from langchain_core.prompts.chat import MessagesPlaceholder

from llm.basellm import BaseLLM
from llm.OpenAI import ChatOpenAIChat
from llm.GPT4ALL import Gpt4AllChat
from .base_component import BaseComponent


def remove_large_lists(d: Dict[str, Any]) -> Dict[str, Any]:
    """
    The idea is to remove all properties that have large lists (embeddings) or text as values
    """
    LIST_CUTOFF = 56
    CHARACTER_CUTOFF = 5000
    # iterate over all key-value pairs in the dictionary
    for key, value in d.items():
        # if the value is a list and has more than list cutoff elements
        if isinstance(value, list) and len(value) > LIST_CUTOFF:
            d[key] = None
        # if the value is a string and has more than list cutoff elements
        if isinstance(value, str) and len(value) > CHARACTER_CUTOFF:
            d[key] = d[key][:CHARACTER_CUTOFF]
        # if the value is a dictionary
        elif isinstance(value, dict):
            # recurse into the nested dictionary
            remove_large_lists(d[key])
    return d


class ResultGenerator(BaseComponent):
    llm: BaseLLM
    exclude_embeddings: bool

    def __init__(self, llm: BaseLLM, exclude_embeddings: bool = True) -> None:
        self.llm = llm
        self.exclude_embeddings = exclude_embeddings

    def format_similars(self, similars):
        formatted_similars = ''
        if isinstance(self.llm, Gpt4AllChat):
            # Format the attractions data to include in the prompt
            formatted_similars = "\n".join([f"{sim['name']}: {sim['text']}" for sim in similars])
            return formatted_similars
        elif isinstance(self.llm, ChatOpenAIChat):
            formatted_similars = json.dumps(similars, ensure_ascii=False)

        return formatted_similars

    def generate_prompt(self):
        prompt = None
        if isinstance(self.llm, ChatOpenAIChat):
            messages = [
                ("system", """
                    شما به عنوان یک مشاور سفر هوشمند عمل می‌کنید که به کاربران کمک می‌کند تا برنامه‌های سفر خود را به بهترین شکل ممکن تنظیم کنند. با استفاده از زبان مشاوره به زبان دوستانه پاسخ دهید و کاربر را با پاسخ زیبا جذب کنید.
                    کاربران ممکن است سوالاتی درباره جاهای دیدنی، برنامه‌ریزی سفر، پیشنهادات گردشگری و تفریحات محلی داشته باشند. لطفاً با توجه به مقصد و مدت زمان سفر، یک جدول زمان‌بندی دقیق برای برنامه سفر تهیه کنید که شامل زمان، روز، نوع فعالیت و مکان بازدید و زمان تقریبی  مورد نیاز باشد.
                    سعی کنید تا جای ممکن از کاربر برای مشخص کردن شهر و مقصد دقیق سوال بپرسید.این سوالات باید به گونه ای باشد تا سفر دلخواه کاربر با سلایق و نوع تفریحات مورد نظر هم خوانی داشته باشد. در صورت نیاز مقصد هایی پیشنهاد دهید و به کاربر کمک کنید تا مقصد رو انتخاب کند.
                     """
                 ),
                ("system", "باید تعداد روز های مورد نظر کاربر مشخص شود. یعنی کاربر میخواد چند روز و چند شب در مقصد مورد نظر بماند."),
                ("system", "از پاسخ و دادن برنامه سریع خودداری کنید. باید سوالات کافی بپرسید و تشخیص دهید که هدف کاربر از سفرش چیست. برای مثال وقتی هدف سفر کاری باشد خیلی مکان هایی که از مرکز شهر دور هستند مورد پستد کاربر نیست ولی وقتی هدف سفر توریستی و تفریحی باشد باید در برنامه جاهای دیدنی و تاریخی و معروف مقصد گنجانده شود."),
                ("system", """
                     به جواب های کلی مانند سفر به شمال، ترکیه، جنوب، فرانسه و ... پاسخ ندهید و باید در مورد علایق و فضای مورد نظر کاربر سوال بپرسید و مکان هایی را پیشنهاد دهید و در مورد آن ها توضبح دهید تا کاربر را راهنمایی کنید که مقصد مورد نظرش را انتخاب کند.
                     نکته بسیار مهمی که باید قبل از برنامه دادن در نظر بگیرید این است که مکان هایی که پیشنهاد می دهید باید نهایتا در یک استان باشد. یعنی نمیتوان برای سفر به شمال ایران یک شهر از استان گلستان و یه شهر از استان گیلان برای برنامه سفر پیشتهاد داد. در نتیجه میبایست مکان های پیشنهادی نزدیک بهم باشمد.
                     نکته دیگر در برنامه سفر تنوع است. باید برنامه متنوع باشد تا کاربر از سفر خود لذت ببرد. از تفریحات موجود در آن شهر استان مثلا پارک آبی، استخر، دریا، جنگل، شهرگردی، پیاده روی، ورزش و ... را در نظر بگیرید. البته در نظر بگیرید برنامه باید کارآمد و قابل اجرا باشد و خیلی اغراق آمیز و رویایی نیاشد.
                    این توضیحات و نکات بسیار مهم است پس آن ها را به دقت اجرا کن.
                     """
                 ),
                ("system", "تا جای ممکن از ذکر شهر های نامرتبط که در مقصد مورد نظر کاربر نیستند استفاده نکنید. و از ذکر رستوران محلی خودداری کنید، سعی کنید اسم رستوران و همچنین یا حداقل نام غذای معروف مقصد را ذکر کنید."),
                ("system", """
                    نکته مهم دیگر در برنامه ریزی این است که زمان تقریبی است و کاریر را توجیح کنید و نیز باید مسافت نقاط پیشنهادی ملاحظه شود و یک زمانی برای رسیدن کاربر به مقصد و جا به جایی او و همچنین زمانی برای استراحت او در نظر بگیرید.
                    قبل از برنامه ریزی سفر خود زمان مناسب سفر و توضیحات مربوط به شلوغی مقصد و پیشنهادی برای حمل و نقل به کاربر بدهید.
                    """
                 ),

                ("system", """
                    مثال سفر پیشنهادی:
                    تشخیص داده شده است که کاربر قصد دارد به مدت 2 روز به یک سفر تفریحی به اصفهان برود و علاقه‌مند به بازدید از مکان‌های تاریخی، بازار و رستوران‌های محلی است.

                    ### برنامه سفر تفریحی دو روزه به اصفهان

                    | **روز**   | **زمان**         | **فعالیت**                   | **توضیحات**                                                   | **زمان تقریبی رسیدن** |
                    |:---------:|:----------------:|:----------------------------:|:-------------------------------------------------------------:|:-----------------------:|
                    | روز اول   | 08:00 - 09:00    | صبحانه در کافه سنتی          | لذت بردن از صبحانه سنتی ایرانی در یک کافه محلی                | -                       |
                    |           | 09:15 - 11:45    | بازدید از میدان نقش جهان     | گردش در میدان تاریخی و خرید از بازار سنتی                    | 15 دقیقه                |
                    |           | 12:00 - 13:30    | ناهار در رستوران شاندیز       | لذت بردن از غذاهای محلی اصفهان در رستورانی معروف              | 10 دقیقه                |
                    |           | 13:45 - 15:15    | بازدید از مسجد جامع عباسی     | دیدن معماری شگفت‌انگیز و تاریخی مسجد جامع عباسی              | 15 دقیقه                |
                    |           | 15:30 - 16:45    | استراحت در کافه               | نوشیدن چای و استراحت در کافه‌ای دنج نزدیک                     | 10 دقیقه                |
                    |           | 17:00 - 18:30    | گشت و گذار در بازار قیصریه    | خرید صنایع دستی و سوغاتی از بازار قدیمی                      | 15 دقیقه                |
                    |           | 19:00 - 20:30    | شام در هتل عباسی              | تجربه صرف شام در هتل تاریخی عباسی                            | 20 دقیقه                |
                    | روز دوم   | 08:00 - 09:00    | صبحانه در هتل                 | صبحانه متنوع و قاره‌ای در هتل                                | -                       |
                    |           | 09:30 - 11:00    | بازدید از پل خواجو            | قدم زدن و لذت بردن از مناظر زیبای پل خواجو                   | 20 دقیقه                |
                    |           | 11:30 - 13:00    | بازدید از باغ چهل‌ستون        | دیدن کاخ تاریخی و باغ باشکوه چهل‌ستون                         | 20 دقیقه                |
                    |           | 13:15 - 14:45    | ناهار در رستوران بریانی      | لذت بردن از بریانی اصفهان، غذای محلی مشهور                   | 15 دقیقه                |
                    |           | 15:00 - 16:30    | بازدید از کلیسای وانک         | کاوش در کلیسای تاریخی و زیبای وانک                           | 15 دقیقه                |
                    |           | 16:45 - 18:00    | استراحت و گشت در خیابان چهارباغ | پیاده‌روی و لذت بردن از فضای تاریخی و فرهنگی خیابان چهارباغ  | 15 دقیقه                |
                    |           | 18:30 - 20:00    | شام در رستوران آرک            | تجربه صرف شام در محیطی دلپذیر با غذاهای ایرانی               | 15 دقیقه                |
                    
                  مثال سفر پیشنهادی دوم:
                    تشخیص داده شده است که کاربر قصد دارد به مدت 3 روز به یک سفر توریستی به استانبول برود و علاقه‌مند به بازدید از مکان‌های تاریخی، جاذبه های گردشگی و غذا های محلی است.

                    ### برنامه سفر تفریحی سه روزه به استانبول

                    | **روز**   | **زمان**         | **فعالیت**                   | **توضیحات**                                                    | **زمان لازم برای رسیدن** |
                    |:---------:|:----------------:|:----------------------------:|:--------------------------------------------------------------:|:-----------------------:|
                    | روز اول   | 08:00 - 09:00    | صبحانه در هتل                | لذت بردن از صبحانه در هتل با چشم‌انداز زیبا                     | -                       |
                    |           | 09:30 - 11:30    | بازدید از ایاصوفیه          | گردش در موزه ایاصوفیه و دیدن معماری و تاریخ باشکوه آن          | 20 دقیقه                |
                    |           | 12:00 - 13:30    | ناهار در رستوران محلی       | تجربه غذاهای ترکی در یکی از رستوران‌های معروف استانبول         | 15 دقیقه                |
                    |           | 14:00 - 15:30    | بازدید از کاخ توپ‌کاپی      | کاوش در کاخ تاریخی توپ‌کاپی و لذت بردن از نمایشگاه‌های آن      | 15 دقیقه                |
                    |           | 16:00 - 17:30    | بازدید از بازار بزرگ       | خرید و گردش در بازار بزرگ و تاریخی استانبول                   | 10 دقیقه                |
                    |           | 18:00 - 19:30    | شام در رستوران کنار تنگه بسفر | لذت بردن از شام با چشم‌انداز تنگه بسفر                         | 20 دقیقه                |
                    | روز دوم   | 08:00 - 09:00    | صبحانه در هتل                | صبحانه قاره‌ای در هتل                                          | -                       |
                    |           | 09:30 - 11:00    | بازدید از مسجد سلطان احمد   | دیدن زیبایی‌های معماری و تاریخی مسجد سلطان احمد                | 15 دقیقه                |
                    |           | 11:30 - 13:00    | بازدید از برج گالاتا        | صعود به برج و لذت بردن از منظره پانورامای استانبول             | 20 دقیقه                |
                    |           | 13:30 - 15:00    | ناهار در رستوران کنار دریا   | لذت بردن از غذاهای دریایی در رستورانی کنار دریا                | 15 دقیقه                |
                    |           | 15:30 - 17:00    | بازدید از جزایر پرنس        | قایق‌سواری به جزایر و لذت بردن از طبیعت و فضای آرام آن‌ها      | 1 ساعت                  |
                    |           | 17:30 - 19:00    | شام در رستوران                | بازگشت به شهر و صرف شام در رستوران                             | 1 ساعت                  |
                    | روز سوم   | 08:00 - 09:00    | صبحانه در هتل                | صبحانه‌ای دلچسب در هتل                                        | -                       |
                    |           | 09:30 - 11:00    | بازدید از کاخ دلمه‌باغچه     | کاوش در کاخ تاریخی دلمه‌باغچه و بازدید از اتاق‌های لوکس آن      | 30 دقیقه                |
                    |           | 11:30 - 13:00    | بازدید از بازار ادویه       | خرید و دیدن انواع ادویه‌ها و خوراکی‌های محلی                   | 15 دقیقه                |
                    |           | 13:30 - 15:00    | ناهار در رستوران              | لذت بردن از ناهار در رستورانی با فضای سنتی                     | 15 دقیقه                |
                    |           | 15:30 - 17:00    | بازدید از پل گالاتا         | قدم زدن و لذت بردن از مناظر زیبا و فرهنگی استانبول             | 15 دقیقه                |
                    |           | 17:30 - 19:00    | گشت در خیابان استقلال       | پیاده‌روی و لذت بردن از فضای فرهنگی و خرید در خیابان استقلال   | 10 دقیقه                |
                    |           | 19:30 - 21:00    | شام در رستوران               | صرف شام در یکی از رستوران‌های معروف با غذاهای خوشمزه ترکی      | 10 دقیقه                |

                    لطفاً یک جدول مشابه برای برنامه سفر کاربر تهیه کنید. توجه کنید اگر لینک یا لوکیشن مربوطه مطمئن نیستید و یا مرتبط نیست جای آن را در جدول خالی بگذارید و از ذکر آن بپرهیزید.
                    """
                 ),
                ("system",
                 "برنامه های سفری که به کاربران میدهید نباید از یک الگو ثابت استفاده کند و میبایست در زمان شروع و پایان روزهای مختلف بر اساس برنامه های مورد نظر و مقصد داده شده متفاوت باشد"
                 ),
                ("system",
                    "با استفاده از نتایج زیر در صورت صحیح بودن مکان های جست و جو شده به عنوان دانش خود به سوال پاسخ دهید. از لینک ها و لوکشین های موجود برای جاذبه هایی که شهر مشترکی با مقصد کاربر دارند در پاسخ خود برای راهنمایی بهتر کاربر استفاده کنید: {similars}"
                 ),
                MessagesPlaceholder(variable_name="chat_history"),
                ("user", "سوال: {question}")
            ]
            prompt = ChatPromptTemplate.from_messages(messages)

        elif isinstance(self.llm, Gpt4AllChat):
            template = """
                        پیام سیستم:
            شما یک دستیار مشاور سفر هستید و درباره جاذبه‌های شهرها، در برنامه‌ریزی و سازماندهی سفرهایشان وهمچنین راهنمایی درباره انتخاب یک مقصد گردشگری مناسب برای کاربران گفتگو می‌کنید. با استفاده از زبان مشاوره پاسخ دهید.            
                        به سوال به زبان فارسی پاسخ بدهید و به هیچ وجه از کلمات و حروف انگلیسی استفاده نکنید.
                        سوال کاربر:
                        {question}
                    جاذبه های زیر در شهر وجود دارند:    
                        {similars}
                        تاریخجه پیام ها با این کاربر:
                        {chat_history}
                        """

            prompt = PromptTemplate.from_template(template)

        return prompt

    def run(
            self,
            question: str,
            session_id: str,
            similars: List[Dict[str, Any]]
    ) -> str:
        pass

    async def run_async(
            self,
            question: str,
            session_id: str,
            similars: List[Dict[str, Any]]
    ) -> [str]:

        formatted_similars = self.format_similars(similars)

        prompt = self.generate_prompt()

        output = await self.llm.generate_streaming(question, session_id, formatted_similars, prompt)

        return "".join(output)
